stagingprosecutorsspi-integration-test/src/test/resources/mockFiles/expectedSPIOutPayload.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SubmitRequestMes xmlns="http://schemas.cjse.gov.uk/endpoint/types/"><RequestID>efaf91d1-e409-4955-ad2b-db7105bb7ed4</RequestID><SourceID>C00CommonPlatform</SourceID><DestinationID>Z00CJSE</DestinationID><ExecMode>ASYNCH</ExecMode><Timestamp>2019-05-06T15:51:27.632Z</Timestamp><Message>&lt;?xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;&lt;RouteData VersionNumber="1.0" xmlns="http://schemas.cjse.gov.uk/common/operations" xmlns:ns2="http://schemas.cjse.gov.uk/common/businessentities" xmlns:ns3="http://schemas.cjse.gov.uk/common/businesstypes"&gt;&lt;RequestFromSystem VersionNumber="1.0"&gt;&lt;CorrelationID&gt;be98e1f7-9367-40eb-b45c-9af3f4014097&lt;/CorrelationID&gt;&lt;SystemID&gt;C00CommonPlatform&lt;/SystemID&gt;&lt;OrganizationalUnitID/&gt;&lt;DataController/&gt;&lt;/RequestFromSystem&gt;&lt;DataStream VersionNumber="1.0"&gt;&lt;ns2:System&gt;C00CommonPlatform&lt;/ns2:System&gt;&lt;ns2:DataStreamType&gt;SPIResults&lt;/ns2:DataStreamType&gt;&lt;ns2:SystemDataStreamID&gt;be98e1f7-9367-40eb-b45c-9af3f4014097&lt;/ns2:SystemDataStreamID&gt;&lt;ns2:ContentType&gt;text/xml&lt;/ns2:ContentType&gt;&lt;ns2:DataStreamContent&gt;Arche team to implement converter. Please replace JsonObject with POJO&lt;/ns2:DataStreamContent&gt;&lt;/DataStream&gt;&lt;Routes VersionNumber="1.0"&gt;&lt;Route VersionNumber="1.0"&gt;&lt;RouteID&gt;1&lt;/RouteID&gt;&lt;RouteSourceSystem&gt;C00CommonPlatform&lt;/RouteSourceSystem&gt;&lt;RouteDestinationSystem&gt;00501PoliceCaseSystem&lt;/RouteDestinationSystem&gt;&lt;/Route&gt;&lt;/Routes&gt;&lt;/RouteData&gt;</Message></SubmitRequestMes></soap:Body></soap:Envelope>